Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/home/atlantis/.atlantis/repos/owirtifo/app-atlantis-test/22/default/default.tfplan"' in '/home/atlantis/.atlantis/repos/owirtifo/app-atlantis-test/22/default': exit status 1
Run plan on default

data.terraform_remote_state.default: Reading...
data.terraform_remote_state.default: Read complete after 0s
yandex_resourcemanager_folder_iam_member.editor: Refreshing state... [id=b1gge1m2ng2nlr4df7bo/editor/serviceAccount:ajek96hd6ch3b3ci5i9d]
yandex_kms_symmetric_key.s3-key: Refreshing state... [id=abjn16oklrm390k1h9kj]
yandex_resourcemanager_folder.netology: Refreshing state... [id=b1gge1m2ng2nlr4df7bo]
yandex_ydb_database_serverless.terraform-state-lock-db: Refreshing state... [id=etnsg0qggnj71e9g5om0]
yandex_resourcemanager_folder_iam_member.images-puller: Refreshing state... [id=b1gge1m2ng2nlr4df7bo/container-registry.images.puller/serviceAccount:ajek96hd6ch3b3ci5i9d]
yandex_resourcemanager_folder_iam_member.sa-editor: Refreshing state... [id=b1gge1m2ng2nlr4df7bo/storage.editor/serviceAccount:ajek96hd6ch3b3ci5i9d]
yandex_iam_service_account.terraform: Refreshing state... [id=ajek96hd6ch3b3ci5i9d]
yandex_iam_service_account_static_access_key.terraform-sk: Refreshing state... [id=ajetjdp94erfnddcn65m]
yandex_storage_bucket.netology-bucket: Refreshing state... [id=netology-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # yandex_iam_service_account.terraform will be destroyed
  # (because yandex_iam_service_account.terraform is not in configuration)
  - resource "yandex_iam_service_account" "terraform" {
      - created_at  = "2025-04-08T08:18:14Z" -> null
      - folder_id   = "b1gge1m2ng2nlr4df7bo" -> null
      - id          = "ajek96hd6ch3b3ci5i9d" -> null
      - name        = "terraform" -> null
        # (1 unchanged attribute hidden)
    }

  # yandex_iam_service_account_static_access_key.terraform-sk will be destroyed
  # (because yandex_iam_service_account_static_access_key.terraform-sk is not in configuration)
  - resource "yandex_iam_service_account_static_access_key" "terraform-sk" {
      - access_key         = "YCAJE9t-ytdfYkNbzegoVR3Zv" -> null
      - created_at         = "2025-04-08T08:18:15Z" -> null
      - description        = "static access key for object storage" -> null
      - id                 = "ajetjdp94erfnddcn65m" -> null
      - secret_key         = (sensitive value) -> null
      - service_account_id = "ajek96hd6ch3b3ci5i9d" -> null
    }

  # yandex_kms_symmetric_key.s3-key will be destroyed
  # (because yandex_kms_symmetric_key.s3-key is not in configuration)
  - resource "yandex_kms_symmetric_key" "s3-key" {
      - created_at          = "2025-04-08T12:03:34Z" -> null
      - default_algorithm   = "AES_128" -> null
      - deletion_protection = false -> null
      - description         = "encrypt s3 bucket" -> null
      - folder_id           = "b1gge1m2ng2nlr4df7bo" -> null
      - id                  = "abjn16oklrm390k1h9kj" -> null
      - labels              = {} -> null
      - name                = "s3-key" -> null
      - rotation_period     = "8760h0m0s" -> null
      - status              = "active" -> null
        # (1 unchanged attribute hidden)
    }

  # yandex_resourcemanager_folder.netology will be destroyed
  # (because yandex_resourcemanager_folder.netology is not in configuration)
  - resource "yandex_resourcemanager_folder" "netology" {
      - cloud_id    = "b1g3q01qijnmfda3qlag" -> null
      - created_at  = "2025-04-08T08:18:12Z" -> null
      - id          = "b1gge1m2ng2nlr4df7bo" -> null
      - labels      = {} -> null
      - name        = "netology" -> null
        # (1 unchanged attribute hidden)
    }

  # yandex_resourcemanager_folder_iam_member.editor will be destroyed
  # (because yandex_resourcemanager_folder_iam_member.editor is not in configuration)
  - resource "yandex_resourcemanager_folder_iam_member" "editor" {
      - folder_id = "b1gge1m2ng2nlr4df7bo" -> null
      - id        = "b1gge1m2ng2nlr4df7bo/editor/serviceAccount:ajek96hd6ch3b3ci5i9d" -> null
      - member    = "serviceAccount:ajek96hd6ch3b3ci5i9d" -> null
      - role      = "editor" -> null
    }

  # yandex_resourcemanager_folder_iam_member.images-puller will be destroyed
  # (because yandex_resourcemanager_folder_iam_member.images-puller is not in configuration)
  - resource "yandex_resourcemanager_folder_iam_member" "images-puller" {
      - folder_id = "b1gge1m2ng2nlr4df7bo" -> null
      - id        = "b1gge1m2ng2nlr4df7bo/container-registry.images.puller/serviceAccount:ajek96hd6ch3b3ci5i9d" -> null
      - member    = "serviceAccount:ajek96hd6ch3b3ci5i9d" -> null
      - role      = "container-registry.images.puller" -> null
    }

  # yandex_resourcemanager_folder_iam_member.sa-editor will be destroyed
  # (because yandex_resourcemanager_folder_iam_member.sa-editor is not in configuration)
  - resource "yandex_resourcemanager_folder_iam_member" "sa-editor" {
      - folder_id = "b1gge1m2ng2nlr4df7bo" -> null
      - id        = "b1gge1m2ng2nlr4df7bo/storage.editor/serviceAccount:ajek96hd6ch3b3ci5i9d" -> null
      - member    = "serviceAccount:ajek96hd6ch3b3ci5i9d" -> null
      - role      = "storage.editor" -> null
    }

  # yandex_storage_bucket.netology-bucket will be destroyed
  # (because yandex_storage_bucket.netology-bucket is not in configuration)
  - resource "yandex_storage_bucket" "netology-bucket" {
      - access_key            = "YCAJE9t-ytdfYkNbzegoVR3Zv" -> null
      - bucket                = "netology-bucket" -> null
      - bucket_domain_name    = "netology-bucket.storage.yandexcloud.net" -> null
      - default_storage_class = "STANDARD" -> null
      - folder_id             = "b1gge1m2ng2nlr4df7bo" -> null
      - force_destroy         = false -> null
      - id                    = "netology-bucket" -> null
      - max_size              = 0 -> null
      - secret_key            = (sensitive value) -> null
      - tags                  = {} -> null
        # (1 unchanged attribute hidden)

      - anonymous_access_flags {
          - config_read = false -> null
          - list        = false -> null
          - read        = false -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "abjn16oklrm390k1h9kj" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

      - versioning {
          - enabled = false -> null
        }
    }

  # yandex_vpc_network.netology-vpc will be created
  + resource "yandex_vpc_network" "netology-vpc" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = "b1gge1m2ng2nlr4df7bo"
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "netology-vpc"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.subnet-a will be created
  + resource "yandex_vpc_subnet" "subnet-a" {
      + created_at     = (known after apply)
      + folder_id      = "b1gge1m2ng2nlr4df7bo"
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet-a"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.4.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_ydb_database_serverless.terraform-state-lock-db will be destroyed
  # (because yandex_ydb_database_serverless.terraform-state-lock-db is not in configuration)
  - resource "yandex_ydb_database_serverless" "terraform-state-lock-db" {
      - created_at            = "2025-04-08T12:03:34Z" -> null
      - database_path         = "/ru-central1/b1g3q01qijnmfda3qlag/etnsg0qggnj71e9g5om0" -> null
      - deletion_protection   = false -> null
      - document_api_endpoint = "https://docapi.serverless.yandexcloud.net/ru-central1/b1g3q01qijnmfda3qlag/etnsg0qggnj71e9g5om0" -> null
      - folder_id             = "b1gge1m2ng2nlr4df7bo" -> null
      - id                    = "etnsg0qggnj71e9g5om0" -> null
      - labels                = {} -> null
      - location_id           = "ru-central1" -> null
      - name                  = "terraform-state-lock-db" -> null
      - sleep_after           = 0 -> null
      - status                = "RUNNING" -> null
      - tls_enabled           = true -> null
╷
      - ydb_api_endpoint      = "ydb.serverless.yandexcloud.net:2135" -> null
      - ydb_full_endpoint     = "grpcs://ydb.serverless.yandexcloud.net:2135/?database=/ru-central1/b1g3q01qijnmfda3qlag/etnsg0qggnj71e9g5om0" -> null
│ Error: Invalid provider configuration
        # (1 unchanged attribute hidden)
│ 

      - serverless_database {
          - enable_throttling_rcu_limit = false -> null
│ Provider "registry.terraform.io/hashicorp/aws" requires explicit
│ configuration. Add a provider block to the root module and configure the
│ provider's required arguments as described in the provider documentation.
          - provisioned_rcu_limit       = 0 -> null
│ 
╵
          - storage_size_limit          = 1 -> null
          - throttling_rcu_limit        = 0 -> null
        }
╷
│ Error: No valid credential sources found
│ 
    }

│   with provider["registry.terraform.io/hashicorp/aws"],
Plan: 2 to add, 0 to change, 9 to destroy.
│   on <empty> line 0:
│   (source code not available)

│ 
Changes to Outputs:
  - folder_iam_member  = {
│ Please see https://registry.terraform.io/providers/hashicorp/aws
      - folder_id   = "b1gge1m2ng2nlr4df7bo"
│ for more information about providing credentials.
│ 
      - id          = "b1gge1m2ng2nlr4df7bo/editor/serviceAccount:ajek96hd6ch3b3ci5i9d"
      - member      = "serviceAccount:ajek96hd6ch3b3ci5i9d"
│ Error: failed to refresh cached credentials, no EC2 IMDS role found,
│ operation error ec2imds: GetMetadata, request canceled, context deadline
      - role        = "editor"
      - sleep_after = null
│ exceeded
│ 
      - timeouts    = null
    } -> null
╵
  - folder_id          = "b1gge1m2ng2nlr4df7bo" -> null
  - service_account_id = "ajek96hd6ch3b3ci5i9d" -> null

```
</details>